[
  {
    "year": "1994",
    "img": "/assets/timeline/images/1994.jpg",
    "side": "up",
    "line": "A small-town Wisconsin kid—first-gen. College wasn't even on the radar yet."
  },
  {
    "year": "2008",
    "img": "/assets/timeline/images/2008.jpg",
    "line": "High school: IB program, band rehearsals, late-night diner shifts. Kept those diner jobs until grad school."
  },
  {
    "year": "2013",
    "img": "/assets/timeline/images/2013.jpg",
    "line": "Discovered logic, Kuhn, and the philosophy of science. Realized arguments about truth and evidence could be my life’s work."
  },
  {
    "year": "2015",
    "img": "/assets/timeline/images/2015.jpg",
    "line": "Wrote my M.A. thesis with Yoshida at Ohio U. Asked: what is perspectivalism?"
  },
  {
    "year": "2017",
    "img": "/assets/timeline/images/2017.jpg",
    "line": "Became Lisa Lloyd’s research assistant at Indiana U. Dug into philosophy of modeling and robustness. Learned how philosophers and scientists talk past—and to—each other."
  },
  {
    "year": "2019",
    "img": "/assets/timeline/images/2019.jpg",
    "line": "First visit to NCAR. Saw climate models in action. Philosophy suddenly felt less abstract, more urgent."
  },
  {
    "year": "2021",
    "img": "/assets/timeline/images/2021.jpg",
    "line": "Published my first peer-reviewed paper on robustness reasoning. My entry into philosophy’s journals."
  },
  {
    "year": "2022",
    "img": "/assets/timeline/images/2022.jpg",
    "line": "A whirlwind year: *Jan*-Married; *June*-Got my PhD; *July*-Moved from Indiana to NYC; *Aug*-Started as Assistant Professor at Queens College; *Sept*-became a dad."
  },
  {
    "year": "2023",
    "img": "/assets/timeline/images/2023.jpg",
    "line": "Began giving a seris of talks at NASA GISS. Brought philosophy directly into scientific spaces: how to trust knowledge under deep uncertainty."
  },
  {
    "year": "2025",
    "img": "/assets/timeline/images/2025.jpg",
    "line": "Appointed as Doctoral Faculty at the CUNY Graduate Center. Recognition that I’m not only bridging to science, but shaping the next generation of philosophers of science."
  }
]
